Revit 2027 API
PropertySetElement.Create Method
Overload List
Name | Description
Create(Document, EmbodiedCarbonAsset) |  Creates a new PropertySetElement to contain the given asset.
Create(Document, StructuralAsset) |  Creates a new PropertySetElement to contain the given asset.
Create(Document, ThermalAsset) |  Creates a new PropertySetElement to contain the given asset.
Top
See Also
Reference
PropertySetElement Class
Autodesk.Revit.DB Namespace